# 1) Репозиторий - хранилище проекта, код, документация и тд.
# 2) Ветка - независимая линия разработки< полезная вещь
# 3) Коммит - сохранение, чекпоинт в программе
# 4) Пуш - отправка локальных изменений в удаленный репозиторий, то бишь на гитхаб


# Комманды
# git init - инициализирует новый репозхиторий
# git clone <<ссылка>> - клонирует удаленный репозиторий
# git status - показывает состояние каждого файла в рабочей папке
# git add <файл> или git add . - добавляет файлы в учет для следующего коммита
# git commit -m ''сообщение / описание - фиксирует изменения в репозитории
# git push - оправляет изменения в удаленный репозиторий
# git checkout <имя ветки> - переключается на указанную ветку